export type Ability = {
  name: string
  PP: number
}

export const abilityList: Ability[] = [
  {
    name: '10まんばりき',
    PP: 10,
  },
  {
    name: '10まんボルト',
    PP: 15,
  },
  {
    name: 'DDラリアット',
    PP: 10,
  },
  {
    name: 'Gのちから',
    PP: 10,
  },
  {
    name: 'Vジェネレート',
    PP: 5,
  },
  {
    name: 'アームハンマー',
    PP: 10,
  },
  {
    name: 'アイアンテール',
    PP: 15,
  },
  {
    name: 'アイアンヘッド',
    PP: 15,
  },
  {
    name: 'アイアンローラー',
    PP: 5,
  },
  {
    name: 'あおいほのお',
    PP: 5,
  },
  {
    name: 'アクアジェット',
    PP: 20,
  },
  {
    name: 'アクアテール',
    PP: 10,
  },
  {
    name: 'アクアブレイク',
    PP: 10,
  },
  {
    name: 'アクアリング',
    PP: 20,
  },
  {
    name: 'アクセルロック',
    PP: 20,
  },
  {
    name: 'あくのはどう',
    PP: 15,
  },
  {
    name: 'あくび',
    PP: 10,
  },
  {
    name: 'アクロバット',
    PP: 15,
  },
  {
    name: 'あさのひざし',
    PP: 5,
  },
  {
    name: 'アシストギア',
    PP: 20,
  },
  {
    name: 'アシストパワー',
    PP: 10,
  },
  {
    name: 'アシッドボム',
    PP: 20,
  },
  {
    name: 'あてみなげ',
    PP: 10,
  },
  {
    name: 'あなをほる',
    PP: 10,
  },
  {
    name: 'あばれる',
    PP: 10,
  },
  {
    name: 'アフロブレイク',
    PP: 15,
  },
  {
    name: 'あまいかおり',
    PP: 20,
  },
  {
    name: 'あまえる',
    PP: 20,
  },
  {
    name: 'あまごい',
    PP: 5,
  },
  {
    name: 'あやしいひかり',
    PP: 10,
  },
  {
    name: 'あられ',
    PP: 10,
  },
  {
    name: 'アロマセラピー',
    PP: 5,
  },
  {
    name: 'アロマミスト',
    PP: 20,
  },
  {
    name: 'アンカーショット',
    PP: 20,
  },
  {
    name: 'アンコール',
    PP: 5,
  },
  {
    name: 'あんこくきょうだ',
    PP: 5,
  },
  {
    name: 'いあいぎり',
    PP: 30,
  },
  {
    name: 'いえき',
    PP: 10,
  },
  {
    name: 'イカサマ',
    PP: 15,
  },
  {
    name: 'いかりのこな',
    PP: 20,
  },
  {
    name: 'いかりのまえば',
    PP: 10,
  },
  {
    name: 'いたみわけ',
    PP: 20,
  },
  {
    name: 'いちゃもん',
    PP: 15,
  },
  {
    name: 'いとをはく',
    PP: 40,
  },
  {
    name: 'いのちがけ',
    PP: 5,
  },
  {
    name: 'いのちのしずく',
    PP: 10,
  },
  {
    name: 'いばる',
    PP: 15,
  },
  {
    name: 'いびき',
    PP: 15,
  },
  {
    name: 'いやしのすず',
    PP: 5,
  },
  {
    name: 'いやしのねがい',
    PP: 10,
  },
  {
    name: 'いやしのはどう',
    PP: 10,
  },
  {
    name: 'いやなおと',
    PP: 40,
  },
  {
    name: 'いわおとし',
    PP: 15,
  },
  {
    name: 'いわくだき',
    PP: 15,
  },
  {
    name: 'いわなだれ',
    PP: 10,
  },
  {
    name: 'インファイト',
    PP: 5,
  },
  {
    name: 'ウェザーボール',
    PP: 10,
  },
  {
    name: 'うずしお',
    PP: 15,
  },
  {
    name: 'うそなき',
    PP: 20,
  },
  {
    name: 'うたう',
    PP: 15,
  },
  {
    name: 'うたかたのアリア',
    PP: 10,
  },
  {
    name: 'うちおとす',
    PP: 15,
  },
  {
    name: 'ウッドハンマー',
    PP: 15,
  },
  {
    name: 'ウッドホーン',
    PP: 10,
  },
  {
    name: 'うっぷんばらし',
    PP: 5,
  },
  {
    name: 'うらみ',
    PP: 10,
  },
  {
    name: 'エアカッター',
    PP: 25,
  },
  {
    name: 'エアスラッシュ',
    PP: 15,
  },
  {
    name: 'エコーボイス',
    PP: 15,
  },
  {
    name: 'えだづき',
    PP: 40,
  },
  {
    name: 'エナジーボール',
    PP: 10,
  },
  {
    name: 'エラがみ',
    PP: 10,
  },
  {
    name: 'エレキネット',
    PP: 15,
  },
  {
    name: 'エレキフィールド',
    PP: 10,
  },
  {
    name: 'エレキボール',
    PP: 10,
  },
  {
    name: 'えんまく',
    PP: 20,
  },
  {
    name: 'おいかぜ',
    PP: 15,
  },
  {
    name: 'おいわい',
    PP: 40,
  },
  {
    name: 'オーバードライブ',
    PP: 10,
  },
  {
    name: 'オーバーヒート',
    PP: 5,
  },
  {
    name: 'オーラぐるま',
    PP: 10,
  },
  {
    name: 'オーロラビーム',
    PP: 20,
  },
  {
    name: 'オーロラベール',
    PP: 20,
  },
  {
    name: 'おきみやげ',
    PP: 10,
  },
  {
    name: 'オクタンほう',
    PP: 10,
  },
  {
    name: 'おさきにどうぞ',
    PP: 15,
  },
  {
    name: 'おたけび',
    PP: 30,
  },
  {
    name: 'おだてる',
    PP: 15,
  },
  {
    name: 'おちゃかい',
    PP: 10,
  },
  {
    name: 'おどろかす',
    PP: 15,
  },
  {
    name: 'おにび',
    PP: 15,
  },
  {
    name: 'おんねん',
    PP: 5,
  },
  {
    name: 'ガードシェア',
    PP: 10,
  },
  {
    name: 'ガードスワップ',
    PP: 10,
  },
  {
    name: 'かいでんぱ',
    PP: 15,
  },
  {
    name: 'かいりき',
    PP: 15,
  },
  {
    name: 'カウンター',
    PP: 20,
  },
  {
    name: 'かえんぐるま',
    PP: 25,
  },
  {
    name: 'かえんほうしゃ',
    PP: 15,
  },
  {
    name: 'かえんボール',
    PP: 5,
  },
  {
    name: 'かげうち',
    PP: 30,
  },
  {
    name: 'かげぬい',
    PP: 10,
  },
  {
    name: 'かげぶんしん',
    PP: 15,
  },
  {
    name: 'かぜおこし',
    PP: 35,
  },
  {
    name: 'かたきうち',
    PP: 5,
  },
  {
    name: 'かたくなる',
    PP: 30,
  },
  {
    name: 'かなしばり',
    PP: 20,
  },
  {
    name: 'かふんだんご',
    PP: 15,
  },
  {
    name: 'かみくだく',
    PP: 15,
  },
  {
    name: 'かみつく',
    PP: 25,
  },
  {
    name: 'かみなり',
    PP: 10,
  },
  {
    name: 'かみなりのキバ',
    PP: 15,
  },
  {
    name: 'かみなりパンチ',
    PP: 15,
  },
  {
    name: 'がむしゃら',
    PP: 5,
  },
  {
    name: 'からげんき',
    PP: 20,
  },
  {
    name: 'からにこもる',
    PP: 40,
  },
  {
    name: 'からをやぶる',
    PP: 15,
  },
  {
    name: 'かわらわり',
    PP: 15,
  },
  {
    name: 'がんせきふうじ',
    PP: 15,
  },
  {
    name: 'がんせきほう',
    PP: 5,
  },
  {
    name: 'きあいだま',
    PP: 5,
  },
  {
    name: 'きあいだめ',
    PP: 30,
  },
  {
    name: 'きあいパンチ',
    PP: 20,
  },
  {
    name: 'ギアソーサー',
    PP: 15,
  },
  {
    name: 'ギアチェンジ',
    PP: 10,
  },
  {
    name: 'ギガインパクト',
    PP: 5,
  },
  {
    name: 'ギガドレイン',
    PP: 10,
  },
  {
    name: 'きしかいせい',
    PP: 15,
  },
  {
    name: 'キノコのほうし',
    PP: 15,
  },
  {
    name: 'きゅうけつ',
    PP: 10,
  },
  {
    name: 'きょじゅうざん',
    PP: 5,
  },
  {
    name: 'きょじゅうだん',
    PP: 5,
  },
  {
    name: 'きりさく',
    PP: 20,
  },
  {
    name: 'きりばらい',
    PP: 15,
  },
  {
    name: 'キングシールド',
    PP: 10,
  },
  {
    name: 'きんぞくおん',
    PP: 40,
  },
  {
    name: 'クイックターン',
    PP: 20,
  },
  {
    name: 'くさのちかい',
    PP: 10,
  },
  {
    name: 'くさむすび',
    PP: 20,
  },
  {
    name: 'くすぐる',
    PP: 20,
  },
  {
    name: 'くらいつく',
    PP: 10,
  },
  {
    name: 'グラススライダー',
    PP: 20,
  },
  {
    name: 'グラスフィールド',
    PP: 10,
  },
  {
    name: 'グラスミキサー',
    PP: 10,
  },
  {
    name: 'クラブハンマー',
    PP: 10,
  },
  {
    name: 'クリアスモッグ',
    PP: 15,
  },
  {
    name: 'くろいきり',
    PP: 30,
  },
  {
    name: 'くろいまなざし',
    PP: 5,
  },
  {
    name: 'グロウパンチ',
    PP: 20,
  },
  {
    name: 'クロスサンダー',
    PP: 5,
  },
  {
    name: 'クロスチョップ',
    PP: 5,
  },
  {
    name: 'クロスフレイム',
    PP: 5,
  },
  {
    name: 'クロスポイズン',
    PP: 20,
  },
  {
    name: 'げきりん',
    PP: 10,
  },
  {
    name: 'けたぐり',
    PP: 20,
  },
  {
    name: 'ゲップ',
    PP: 10,
  },
  {
    name: 'げんしのちから',
    PP: 5,
  },
  {
    name: 'こうげきしれい',
    PP: 15,
  },
  {
    name: 'こうごうせい',
    PP: 5,
  },
  {
    name: 'こうそくいどう',
    PP: 30,
  },
  {
    name: 'こうそくスピン',
    PP: 40,
  },
  {
    name: 'ゴーストダイブ',
    PP: 10,
  },
  {
    name: 'コーチング',
    PP: 10,
  },
  {
    name: 'コートチェンジ',
    PP: 10,
  },
  {
    name: 'こおりのいぶき',
    PP: 10,
  },
  {
    name: 'こおりのキバ',
    PP: 15,
  },
  {
    name: 'こおりのつぶて',
    PP: 30,
  },
  {
    name: 'コールドフレア',
    PP: 5,
  },
  {
    name: 'こごえるかぜ',
    PP: 15,
  },
  {
    name: 'こごえるせかい',
    PP: 10,
  },
  {
    name: 'こころのめ',
    PP: 5,
  },
  {
    name: 'コスモパワー',
    PP: 20,
  },
  {
    name: 'ゴッドバード',
    PP: 5,
  },
  {
    name: 'コットンガード',
    PP: 10,
  },
  {
    name: 'こなゆき',
    PP: 25,
  },
  {
    name: 'このは',
    PP: 40,
  },
  {
    name: 'このゆびとまれ',
    PP: 20,
  },
  {
    name: 'コメットパンチ',
    PP: 10,
  },
  {
    name: 'こらえる',
    PP: 10,
  },
  {
    name: 'ころがる',
    PP: 20,
  },
  {
    name: 'こわいかお',
    PP: 10,
  },
  {
    name: 'サイケこうせん',
    PP: 20,
  },
  {
    name: 'サイコカッター',
    PP: 20,
  },
  {
    name: 'サイコキネシス',
    PP: 10,
  },
  {
    name: 'サイコシフト',
    PP: 10,
  },
  {
    name: 'サイコショック',
    PP: 10,
  },
  {
    name: 'サイコファング',
    PP: 10,
  },
  {
    name: 'サイコフィールド',
    PP: 10,
  },
  {
    name: 'サイコブレイク',
    PP: 10,
  },
  {
    name: 'サイドチェンジ',
    PP: 15,
  },
  {
    name: 'さいはい',
    PP: 15,
  },
  {
    name: 'さいみんじゅつ',
    PP: 20,
  },
  {
    name: 'さきおくり',
    PP: 15,
  },
  {
    name: 'さわぐ',
    PP: 10,
  },
  {
    name: 'シェルアームズ',
    PP: 10,
  },
  {
    name: 'シェルブレード',
    PP: 10,
  },
  {
    name: 'しおふき',
    PP: 5,
  },
  {
    name: 'しおみず',
    PP: 10,
  },
  {
    name: 'じこあんじ',
    PP: 10,
  },
  {
    name: 'じごくぐるま',
    PP: 20,
  },
  {
    name: 'じごくづき',
    PP: 15,
  },
  {
    name: 'じこさいせい',
    PP: 10,
  },
  {
    name: 'シザークロス',
    PP: 15,
  },
  {
    name: 'じしん',
    PP: 10,
  },
  {
    name: 'しぜんのちから',
    PP: 20,
  },
  {
    name: 'したでなめる',
    PP: 30,
  },
  {
    name: 'じたばた',
    PP: 15,
  },
  {
    name: 'じだんだ',
    PP: 10,
  },
  {
    name: 'しっとのほのお',
    PP: 5,
  },
  {
    name: 'しっぺがえし',
    PP: 10,
  },
  {
    name: 'しっぽをふる',
    PP: 30,
  },
  {
    name: 'じならし',
    PP: 20,
  },
  {
    name: 'しねんのずつき',
    PP: 15,
  },
  {
    name: 'じばく',
    PP: 5,
  },
  {
    name: 'じばそうさ',
    PP: 20,
  },
  {
    name: 'しびれごな',
    PP: 30,
  },
  {
    name: 'しめつける',
    PP: 20,
  },
  {
    name: 'ジャイロボール',
    PP: 5,
  },
  {
    name: 'シャドークロー',
    PP: 15,
  },
  {
    name: 'シャドースチール',
    PP: 10,
  },
  {
    name: 'シャドーパンチ',
    PP: 20,
  },
  {
    name: 'シャドーボール',
    PP: 15,
  },
  {
    name: 'シャドーボーン',
    PP: 10,
  },
  {
    name: 'シャドーレイ',
    PP: 5,
  },
  {
    name: 'じゃれつく',
    PP: 10,
  },
  {
    name: 'じゅうでん',
    PP: 20,
  },
  {
    name: 'じゅうりょく',
    PP: 5,
  },
  {
    name: 'じょうか',
    PP: 20,
  },
  {
    name: 'しろいきり',
    PP: 30,
  },
  {
    name: 'じわれ',
    PP: 5,
  },
  {
    name: 'しんくうは',
    PP: 30,
  },
  {
    name: 'しんそく',
    PP: 5,
  },
  {
    name: 'じんつうりき',
    PP: 20,
  },
  {
    name: 'しんぴのつるぎ',
    PP: 10,
  },
  {
    name: 'しんぴのまもり',
    PP: 25,
  },
  {
    name: 'シンプルビーム',
    PP: 15,
  },
  {
    name: 'スイープビンタ',
    PP: 10,
  },
  {
    name: 'すいとる',
    PP: 25,
  },
  {
    name: 'すいりゅうれんだ',
    PP: 5,
  },
  {
    name: 'スキルスワップ',
    PP: 10,
  },
  {
    name: 'スケイルショット',
    PP: 20,
  },
  {
    name: 'スケイルノイズ',
    PP: 5,
  },
  {
    name: 'スターアサルト',
    PP: 5,
  },
  {
    name: 'ずつき',
    PP: 15,
  },
  {
    name: 'すてゼリフ',
    PP: 20,
  },
  {
    name: 'すてみタックル',
    PP: 15,
  },
  {
    name: 'ステルスロック',
    PP: 20,
  },
  {
    name: 'ストーンエッジ',
    PP: 5,
  },
  {
    name: 'すなあつめ',
    PP: 10,
  },
  {
    name: 'すなあらし',
    PP: 10,
  },
  {
    name: 'すなかけ',
    PP: 15,
  },
  {
    name: 'すなじごく',
    PP: 15,
  },
  {
    name: 'スパーク',
    PP: 20,
  },
  {
    name: 'スピードスター',
    PP: 20,
  },
  {
    name: 'スピードスワップ',
    PP: 10,
  },
  {
    name: 'スプーンまげ',
    PP: 15,
  },
  {
    name: 'スマートホーン',
    PP: 10,
  },
  {
    name: 'スモッグ',
    PP: 20,
  },
  {
    name: 'すりかえ',
    PP: 10,
  },
  {
    name: 'せいちょう',
    PP: 20,
  },
  {
    name: 'せいなるつるぎ',
    PP: 15,
  },
  {
    name: 'ぜったいれいど',
    PP: 5,
  },
  {
    name: 'そうでん',
    PP: 20,
  },
  {
    name: 'ソウルクラッシュ',
    PP: 15,
  },
  {
    name: 'ソウルビート',
    PP: 5,
  },
  {
    name: 'ソーラービーム',
    PP: 10,
  },
  {
    name: 'ソーラーブレード',
    PP: 10,
  },
  {
    name: 'そらをとぶ',
    PP: 15,
  },
  {
    name: 'タールショット',
    PP: 15,
  },
  {
    name: 'たいあたり',
    PP: 35,
  },
  {
    name: 'だいちのちから',
    PP: 10,
  },
  {
    name: 'だいちのはどう',
    PP: 10,
  },
  {
    name: 'だいばくはつ',
    PP: 5,
  },
  {
    name: 'ダイビング',
    PP: 10,
  },
  {
    name: 'ダイマックスほう',
    PP: 5,
  },
  {
    name: 'だいもんじ',
    PP: 5,
  },
  {
    name: 'たきのぼり',
    PP: 15,
  },
  {
    name: 'だくりゅう',
    PP: 10,
  },
  {
    name: 'たくわえる',
    PP: 20,
  },
  {
    name: 'たこがため',
    PP: 15,
  },
  {
    name: 'ダストシュート',
    PP: 5,
  },
  {
    name: 'たたきつける',
    PP: 20,
  },
  {
    name: 'たたみがえし',
    PP: 10,
  },
  {
    name: 'たたりめ',
    PP: 10,
  },
  {
    name: 'たつまき',
    PP: 20,
  },
  {
    name: 'タネばくだん',
    PP: 15,
  },
  {
    name: 'タネマシンガン',
    PP: 30,
  },
  {
    name: 'ダブルアタック',
    PP: 10,
  },
  {
    name: 'ダブルウイング',
    PP: 10,
  },
  {
    name: 'ダブルチョップ',
    PP: 15,
  },
  {
    name: 'ダブルパンツァー',
    PP: 5,
  },
  {
    name: 'タマゴうみ',
    PP: 10,
  },
  {
    name: 'ダメおし',
    PP: 10,
  },
  {
    name: 'ちいさくなる',
    PP: 10,
  },
  {
    name: 'ちからをすいとる',
    PP: 10,
  },
  {
    name: 'ちきゅうなげ',
    PP: 20,
  },
  {
    name: 'チャージビーム',
    PP: 10,
  },
  {
    name: 'チャームボイス',
    PP: 15,
  },
  {
    name: 'ちょうおんぱ',
    PP: 20,
  },
  {
    name: 'ちょうのまい',
    PP: 20,
  },
  {
    name: 'ちょうはつ',
    PP: 20,
  },
  {
    name: 'ついばむ',
    PP: 20,
  },
  {
    name: 'つきのひかり',
    PP: 5,
  },
  {
    name: 'つけあがる',
    PP: 10,
  },
  {
    name: 'つじぎり',
    PP: 15,
  },
  {
    name: 'つつく',
    PP: 35,
  },
  {
    name: 'つっぱり',
    PP: 20,
  },
  {
    name: 'つのでつく',
    PP: 25,
  },
  {
    name: 'つのドリル',
    PP: 5,
  },
  {
    name: 'つばさでうつ',
    PP: 35,
  },
  {
    name: 'つばめがえし',
    PP: 20,
  },
  {
    name: 'つぶらなひとみ',
    PP: 30,
  },
  {
    name: 'つぼをつく',
    PP: 30,
  },
  {
    name: 'つめとぎ',
    PP: 15,
  },
  {
    name: 'つららおとし',
    PP: 10,
  },
  {
    name: 'つららばり',
    PP: 30,
  },
  {
    name: 'つるぎのまい',
    PP: 20,
  },
  {
    name: 'つるのムチ',
    PP: 25,
  },
  {
    name: 'であいがしら',
    PP: 10,
  },
  {
    name: 'てかげん',
    PP: 40,
  },
  {
    name: 'テクスチャー',
    PP: 30,
  },
  {
    name: 'テクスチャー2',
    PP: 30,
  },
  {
    name: 'デコレーション',
    PP: 15,
  },
  {
    name: 'てだすけ',
    PP: 20,
  },
  {
    name: 'てっていこうせん',
    PP: 5,
  },
  {
    name: 'てっぺき',
    PP: 15,
  },
  {
    name: 'テレポート',
    PP: 20,
  },
  {
    name: 'てをつなぐ',
    PP: 40,
  },
  {
    name: 'でんきショック',
    PP: 30,
  },
  {
    name: 'でんげきくちばし',
    PP: 10,
  },
  {
    name: 'でんげきは',
    PP: 20,
  },
  {
    name: 'でんこうせっか',
    PP: 30,
  },
  {
    name: 'てんしのキッス',
    PP: 10,
  },
  {
    name: 'でんじは',
    PP: 20,
  },
  {
    name: 'でんじふゆう',
    PP: 10,
  },
  {
    name: 'でんじほう',
    PP: 5,
  },
  {
    name: 'とおせんぼう',
    PP: 5,
  },
  {
    name: 'トーチカ',
    PP: 10,
  },
  {
    name: 'とおぼえ',
    PP: 40,
  },
  {
    name: 'とぎすます',
    PP: 30,
  },
  {
    name: 'どくガス',
    PP: 40,
  },
  {
    name: 'どくづき',
    PP: 20,
  },
  {
    name: 'どくどく',
    PP: 10,
  },
  {
    name: 'どくどくのキバ',
    PP: 15,
  },
  {
    name: 'どくのこな',
    PP: 35,
  },
  {
    name: 'どくばり',
    PP: 35,
  },
  {
    name: 'どくびし',
    PP: 20,
  },
  {
    name: 'とぐろをまく',
    PP: 20,
  },
  {
    name: 'どげざつき',
    PP: 10,
  },
  {
    name: 'とける',
    PP: 20,
  },
  {
    name: 'とっしん',
    PP: 20,
  },
  {
    name: 'とっておき',
    PP: 5,
  },
  {
    name: 'とどめばり',
    PP: 25,
  },
  {
    name: 'とびかかる',
    PP: 15,
  },
  {
    name: 'とびはねる',
    PP: 5,
  },
  {
    name: 'とびひざげり',
    PP: 10,
  },
  {
    name: 'ともえなげ',
    PP: 10,
  },
  {
    name: 'トライアタック',
    PP: 10,
  },
  {
    name: 'ドラゴンアロー',
    PP: 10,
  },
  {
    name: 'ドラゴンクロー',
    PP: 15,
  },
  {
    name: 'ドラゴンダイブ',
    PP: 10,
  },
  {
    name: 'ドラゴンテール',
    PP: 10,
  },
  {
    name: 'ドラゴンハンマー',
    PP: 15,
  },
  {
    name: 'トラップシェル',
    PP: 5,
  },
  {
    name: 'トラバサミ',
    PP: 15,
  },
  {
    name: 'ドラムアタック',
    PP: 10,
  },
  {
    name: 'トリック',
    PP: 10,
  },
  {
    name: 'トリックガード',
    PP: 10,
  },
  {
    name: 'トリックルーム',
    PP: 5,
  },
  {
    name: 'トリプルアクセル',
    PP: 10,
  },
  {
    name: 'トリプルキック',
    PP: 10,
  },
  {
    name: 'ドリルくちばし',
    PP: 20,
  },
  {
    name: 'ドリルライナー',
    PP: 10,
  },
  {
    name: 'ドレインキッス',
    PP: 10,
  },
  {
    name: 'ドレインパンチ',
    PP: 10,
  },
  {
    name: 'どろかけ',
    PP: 10,
  },
  {
    name: 'トロピカルキック',
    PP: 15,
  },
  {
    name: 'どろぼう',
    PP: 25,
  },
  {
    name: 'ドわすれ',
    PP: 20,
  },
  {
    name: 'とんぼがえり',
    PP: 20,
  },
  {
    name: 'ないしょばなし',
    PP: 20,
  },
  {
    name: 'ナイトバースト',
    PP: 10,
  },
  {
    name: 'ナイトヘッド',
    PP: 15,
  },
  {
    name: 'なかまづくり',
    PP: 15,
  },
  {
    name: 'なかよくする',
    PP: 20,
  },
  {
    name: 'なきごえ',
    PP: 40,
  },
  {
    name: 'なげつける',
    PP: 10,
  },
  {
    name: 'なまける',
    PP: 10,
  },
  {
    name: 'なみだめ',
    PP: 20,
  },
  {
    name: 'なみのり',
    PP: 15,
  },
  {
    name: 'なやみのタネ',
    PP: 10,
  },
  {
    name: 'なりきり',
    PP: 10,
  },
  {
    name: 'ニードルガード',
    PP: 10,
  },
  {
    name: 'にどげり',
    PP: 30,
  },
  {
    name: 'ニトロチャージ',
    PP: 20,
  },
  {
    name: 'にほんばれ',
    PP: 5,
  },
  {
    name: 'にらみつける',
    PP: 30,
  },
  {
    name: 'ねがいごと',
    PP: 10,
  },
  {
    name: 'ねこだまし',
    PP: 10,
  },
  {
    name: 'ねごと',
    PP: 10,
  },
  {
    name: 'ネコにこばん',
    PP: 20,
  },
  {
    name: 'ねっさのだいち',
    PP: 10,
  },
  {
    name: 'ねっとう',
    PP: 15,
  },
  {
    name: 'ねっぷう',
    PP: 10,
  },
  {
    name: 'ねばねばネット',
    PP: 20,
  },
  {
    name: 'ねむりごな',
    PP: 15,
  },
  {
    name: 'ねむる',
    PP: 10,
  },
  {
    name: 'ねらいうち',
    PP: 15,
  },
  {
    name: 'ねをはる',
    PP: 20,
  },
  {
    name: 'ねんりき',
    PP: 25,
  },
  {
    name: 'のしかかり',
    PP: 15,
  },
  {
    name: 'のみこむ',
    PP: 10,
  },
  {
    name: 'のろい',
    PP: 10,
  },
  {
    name: 'バークアウト',
    PP: 15,
  },
  {
    name: 'ハードプラント',
    PP: 5,
  },
  {
    name: 'はいすいのじん',
    PP: 5,
  },
  {
    name: 'ハイドロカノン',
    PP: 5,
  },
  {
    name: 'ハイドロポンプ',
    PP: 5,
  },
  {
    name: 'ハイパーボイス',
    PP: 10,
  },
  {
    name: 'はいよるいちげき',
    PP: 10,
  },
  {
    name: 'はかいこうせん',
    PP: 5,
  },
  {
    name: 'ばかぢから',
    PP: 5,
  },
  {
    name: 'はがねのつばさ',
    PP: 25,
  },
  {
    name: 'はきだす',
    PP: 10,
  },
  {
    name: 'ばくおんぱ',
    PP: 10,
  },
  {
    name: 'ばくれつパンチ',
    PP: 5,
  },
  {
    name: 'ハサミギロチン',
    PP: 5,
  },
  {
    name: 'はさむ',
    PP: 30,
  },
  {
    name: 'はたきおとす',
    PP: 20,
  },
  {
    name: 'はたく',
    PP: 35,
  },
  {
    name: 'はっけい',
    PP: 10,
  },
  {
    name: 'はっぱカッター',
    PP: 25,
  },
  {
    name: 'ハッピータイム',
    PP: 30,
  },
  {
    name: 'はどうだん',
    PP: 20,
  },
  {
    name: 'バトンタッチ',
    PP: 40,
  },
  {
    name: 'はなびらのまい',
    PP: 10,
  },
  {
    name: 'はなふぶき',
    PP: 15,
  },
  {
    name: 'はねやすめ',
    PP: 10,
  },
  {
    name: 'はねる',
    PP: 40,
  },
  {
    name: 'バブルこうせん',
    PP: 20,
  },
  {
    name: 'はめつのねがい',
    PP: 5,
  },
  {
    name: 'はらだいこ',
    PP: 10,
  },
  {
    name: 'パラボラチャージ',
    PP: 20,
  },
  {
    name: 'バレットパンチ',
    PP: 30,
  },
  {
    name: 'ハロウィン',
    PP: 20,
  },
  {
    name: 'パワーウィップ',
    PP: 10,
  },
  {
    name: 'パワーシェア',
    PP: 10,
  },
  {
    name: 'パワージェム',
    PP: 20,
  },
  {
    name: 'パワースワップ',
    PP: 10,
  },
  {
    name: 'パワートリック',
    PP: 10,
  },
  {
    name: 'ヒートスタンプ',
    PP: 10,
  },
  {
    name: 'ひかりのかべ',
    PP: 30,
  },
  {
    name: 'ひっかく',
    PP: 35,
  },
  {
    name: 'ひっくりかえす',
    PP: 20,
  },
  {
    name: 'ひのこ',
    PP: 25,
  },
  {
    name: 'びりびりちくちく',
    PP: 10,
  },
  {
    name: 'ビルドアップ',
    PP: 20,
  },
  {
    name: 'ファストガード',
    PP: 15,
  },
  {
    name: 'ふいうち',
    PP: 5,
  },
  {
    name: 'ふういん',
    PP: 10,
  },
  {
    name: 'フェアリーロック',
    PP: 10,
  },
  {
    name: 'フェイント',
    PP: 10,
  },
  {
    name: 'フェザーダンス',
    PP: 15,
  },
  {
    name: 'フォトンゲイザー',
    PP: 5,
  },
  {
    name: 'ふきとばし',
    PP: 20,
  },
  {
    name: 'ふくろだたき',
    PP: 10,
  },
  {
    name: 'ふしょくガス',
    PP: 40,
  },
  {
    name: 'ふぶき',
    PP: 5,
  },
  {
    name: 'ふみつけ',
    PP: 20,
  },
  {
    name: 'フライングプレス',
    PP: 10,
  },
  {
    name: 'ブラストバーン',
    PP: 5,
  },
  {
    name: 'プラズマフィスト',
    PP: 15,
  },
  {
    name: 'フラフラダンス',
    PP: 20,
  },
  {
    name: 'フラワーガード',
    PP: 10,
  },
  {
    name: 'フラワーヒール',
    PP: 10,
  },
  {
    name: 'フリーズドライ',
    PP: 20,
  },
  {
    name: 'フリーズボルト',
    PP: 5,
  },
  {
    name: 'プリズムレーザー',
    PP: 10,
  },
  {
    name: 'フルールカノン',
    PP: 5,
  },
  {
    name: 'ふるいたてる',
    PP: 30,
  },
  {
    name: 'フレアドライブ',
    PP: 15,
  },
  {
    name: 'ブレイククロー',
    PP: 10,
  },
  {
    name: 'ブレイズキック',
    PP: 10,
  },
  {
    name: 'ブレイブバード',
    PP: 15,
  },
  {
    name: 'プレゼント',
    PP: 15,
  },
  {
    name: 'ブロッキング',
    PP: 10,
  },
  {
    name: 'ふんえん',
    PP: 15,
  },
  {
    name: 'ふんか',
    PP: 5,
  },
  {
    name: 'ぶんまわす',
    PP: 20,
  },
  {
    name: 'ヘドロウェーブ',
    PP: 10,
  },
  {
    name: 'ヘドロこうげき',
    PP: 20,
  },
  {
    name: 'ヘドロばくだん',
    PP: 10,
  },
  {
    name: 'ベノムショック',
    PP: 10,
  },
  {
    name: 'ベノムトラップ',
    PP: 20,
  },
  {
    name: 'ヘビーボンバー',
    PP: 10,
  },
  {
    name: 'へびにらみ',
    PP: 30,
  },
  {
    name: 'へんしん',
    PP: 10,
  },
  {
    name: 'ポイズンテール',
    PP: 25,
  },
  {
    name: 'ぼうぎょしれい',
    PP: 10,
  },
  {
    name: 'ほうでん',
    PP: 15,
  },
  {
    name: 'ぼうふう',
    PP: 10,
  },
  {
    name: 'ほえる',
    PP: 20,
  },
  {
    name: 'ほおばる',
    PP: 10,
  },
  {
    name: 'ボーンラッシュ',
    PP: 10,
  },
  {
    name: 'ほしがる',
    PP: 25,
  },
  {
    name: 'ほっぺすりすり',
    PP: 20,
  },
  {
    name: 'ボディパージ',
    PP: 15,
  },
  {
    name: 'ボディプレス',
    PP: 10,
  },
  {
    name: 'ホネブーメラン',
    PP: 10,
  },
  {
    name: 'ほのおのうず',
    PP: 15,
  },
  {
    name: 'ほのおのキバ',
    PP: 15,
  },
  {
    name: 'ほのおのちかい',
    PP: 10,
  },
  {
    name: 'ほのおのパンチ',
    PP: 15,
  },
  {
    name: 'ほのおのまい',
    PP: 10,
  },
  {
    name: 'ほのおのムチ',
    PP: 15,
  },
  {
    name: 'ポルターガイスト',
    PP: 5,
  },
  {
    name: 'ボルテッカー',
    PP: 15,
  },
  {
    name: 'ボルトチェンジ',
    PP: 20,
  },
  {
    name: 'ほろびのうた',
    PP: 5,
  },
  {
    name: 'まきつく',
    PP: 20,
  },
  {
    name: 'まきびし',
    PP: 20,
  },
  {
    name: 'マジカルシャイン',
    PP: 10,
  },
  {
    name: 'マジカルフレイム',
    PP: 10,
  },
  {
    name: 'マジカルリーフ',
    PP: 20,
  },
  {
    name: 'マジックコート',
    PP: 15,
  },
  {
    name: 'マジックルーム',
    PP: 10,
  },
  {
    name: 'マッドショット',
    PP: 15,
  },
  {
    name: 'マッハパンチ',
    PP: 30,
  },
  {
    name: 'まとわりつく',
    PP: 20,
  },
  {
    name: 'まねっこ',
    PP: 20,
  },
  {
    name: 'まほうのこな',
    PP: 20,
  },
  {
    name: 'まもる',
    PP: 10,
  },
  {
    name: 'まるくなる',
    PP: 40,
  },
  {
    name: 'マルチアタック',
    PP: 10,
  },
  {
    name: 'みがわり',
    PP: 10,
  },
  {
    name: 'みきり',
    PP: 5,
  },
  {
    name: 'ミサイルばり',
    PP: 20,
  },
  {
    name: 'みずしゅりけん',
    PP: 20,
  },
  {
    name: 'みずでっぽう',
    PP: 25,
  },
  {
    name: 'ミストバースト',
    PP: 5,
  },
  {
    name: 'ミストフィールド',
    PP: 10,
  },
  {
    name: 'みずのちかい',
    PP: 10,
  },
  {
    name: 'みずのはどう',
    PP: 20,
  },
  {
    name: 'みずびたし',
    PP: 20,
  },
  {
    name: 'みだれづき',
    PP: 20,
  },
  {
    name: 'みだれひっかき',
    PP: 15,
  },
  {
    name: 'みちづれ',
    PP: 5,
  },
  {
    name: 'みねうち',
    PP: 40,
  },
  {
    name: 'ミラーコート',
    PP: 20,
  },
  {
    name: 'ミラータイプ',
    PP: 15,
  },
  {
    name: 'みらいよち',
    PP: 10,
  },
  {
    name: 'ミルクのみ',
    PP: 10,
  },
  {
    name: 'ムーンフォース',
    PP: 15,
  },
  {
    name: 'ムゲンダイビーム',
    PP: 5,
  },
  {
    name: 'むしくい',
    PP: 20,
  },
  {
    name: 'むしのさざめき',
    PP: 10,
  },
  {
    name: 'むしのていこう',
    PP: 20,
  },
  {
    name: 'めいそう',
    PP: 20,
  },
  {
    name: 'メガドレイン',
    PP: 15,
  },
  {
    name: 'メガトンキック',
    PP: 5,
  },
  {
    name: 'メガトンパンチ',
    PP: 20,
  },
  {
    name: 'メガホーン',
    PP: 10,
  },
  {
    name: 'メタルクロー',
    PP: 35,
  },
  {
    name: 'メタルバースト',
    PP: 10,
  },
  {
    name: 'メテオドライブ',
    PP: 5,
  },
  {
    name: 'メテオビーム',
    PP: 10,
  },
  {
    name: 'メロメロ',
    PP: 15,
  },
  {
    name: 'もえつきる',
    PP: 5,
  },
  {
    name: 'ものまね',
    PP: 10,
  },
  {
    name: 'もりののろい',
    PP: 20,
  },
  {
    name: 'もろはのずつき',
    PP: 5,
  },
  {
    name: 'やきつくす',
    PP: 15,
  },
  {
    name: 'やどりぎのタネ',
    PP: 10,
  },
  {
    name: 'やまあらし',
    PP: 10,
  },
  {
    name: 'ゆきなだれ',
    PP: 10,
  },
  {
    name: 'ゆびをふる',
    PP: 10,
  },
  {
    name: 'ゆめくい',
    PP: 15,
  },
  {
    name: 'ようかいえき',
    PP: 30,
  },
  {
    name: 'ようせいのかぜ',
    PP: 30,
  },
  {
    name: 'らいげき',
    PP: 5,
  },
  {
    name: 'ライジングボルト',
    PP: 20,
  },
  {
    name: 'ラスターカノン',
    PP: 10,
  },
  {
    name: 'リーフストーム',
    PP: 5,
  },
  {
    name: 'リーフブレード',
    PP: 15,
  },
  {
    name: 'リサイクル',
    PP: 10,
  },
  {
    name: 'リフレクター',
    PP: 20,
  },
  {
    name: 'リベンジ',
    PP: 10,
  },
  {
    name: 'りゅうせいぐん',
    PP: 5,
  },
  {
    name: 'りゅうのいぶき',
    PP: 20,
  },
  {
    name: 'りゅうのはどう',
    PP: 10,
  },
  {
    name: 'りゅうのまい',
    PP: 20,
  },
  {
    name: 'りんごさん',
    PP: 10,
  },
  {
    name: 'りんしょう',
    PP: 15,
  },
  {
    name: 'れいとうパンチ',
    PP: 15,
  },
  {
    name: 'れいとうビーム',
    PP: 10,
  },
  {
    name: 'れんごく',
    PP: 5,
  },
  {
    name: 'れんぞくぎり',
    PP: 20,
  },
  {
    name: 'ローキック',
    PP: 20,
  },
  {
    name: 'ロケットずつき',
    PP: 10,
  },
  {
    name: 'ロックオン',
    PP: 5,
  },
  {
    name: 'ロックカット',
    PP: 20,
  },
  {
    name: 'ロックブラスト',
    PP: 10,
  },
  {
    name: 'ワイドガード',
    PP: 10,
  },
  {
    name: 'ワイドフォース',
    PP: 10,
  },
  {
    name: 'ワイドブレイカー',
    PP: 15,
  },
  {
    name: 'ワイルドボルト',
    PP: 15,
  },
  {
    name: 'わたほうし',
    PP: 40,
  },
  {
    name: 'わるあがき',
    PP: 1,
  },
  {
    name: 'わるだくみ',
    PP: 20,
  },
  {
    name: 'ワンダースチーム',
    PP: 10,
  },
  {
    name: 'ワンダールーム',
    PP: 10,
  },
]
